export const grey = {
  50:  '#171923',
  100: '#1A202C',
  200: '#2D3748',
  300: '#343B4F',
  400: '#4A5568',
  500: '#7E89AC',
  600: '#AEB9E1',
  700: '#D1DBF9',
  800: '#D9E1FA',
  900: '#F7FAFC',
};

export const red = {
  50:  '#FFF4F5',
  100: '#FFE1E3',
  200: '#FFC6CB',
  300: '#FFAAB2',
  400: '#FF8F99',
  500: '#FF7480',
  600: '#F8626E',
  700: '#E2535F',
  800: '#CC444F',
  900: '#B2363F',
};

export const green = {
  50:  '#F3FCF6',
  100: '#D8F8E6',
  200: '#B7F1D3',
  300: '#94EBC0',
  400: '#71E4AD',
  500: '#4FDEA1',
  600: '#3ECB91',
  700: '#2BBF84',
  800: '#1DAF75',
  900: '#109D66',
};

export const blue = {
  50:  '#eef9ff',  // 거의 흰색에 가까운 맑은 하늘색
  100: '#d6f0ff',  // 산뜻한 연하늘색
  200: '#ade0ff',  // 맑고 청량한 아쿠아 블루
  300: '#7ecbff',  // 반짝이는 라이트 블루
  400: '#55b7ff',  // 하이라이트용 시원한 블루
  500: '#2fa2ff',  // 포인트로 딱 좋은 밝은 블루
  600: '#1589e5',  // 선명한 미디엄 블루
  700: '#106fbe',  // 푸른기 도는 딥 블루
  800: '#0d5d9f',  // 대비 강조용, 버튼 border 등
  900: '#0a4a7f',  // 가장 어두운 블루, 다크 배경에 적합
};

export const cyan = {
  50:  '#F0FEFF',
  100: '#D6FAFF',
  200: '#B8F4FA',
  300: '#9CEEF6',
  400: '#7EE8F2',
  500: '#60E2EE',
  600: '#48CAD8',
  700: '#3AB3C0',
  800: '#2C9CA8',
  900: '#1D7F8A',
};

export const violate = {
  50:  '#f3e8ff',  // 거의 흰색에 가까운 라벤더
  100: '#e6d0ff',  // 부드러운 연보라
  200: '#d3aefc',  // 사랑스러운 파스텔 보라
  300: '#c38df9',  // 라일락 느낌
  400: '#b16bf6',  // 약간 진한 퍼플 포인트
  500: '#a150f2',  // 선명하면서도 부드러운 퍼플
  600: '#933eea',  // 약간 더 진해진 퍼플 (포인트용)
  700: '#7f2bda',  // 버튼 hover 등 강조용
  800: '#6b1ec4',  // 깊이 있는 보라
  900: '#5912ad',  // 어두운 포인트
};

export const purple = {
  50:  '#f2e9fe',  // 아주 연한 연보라 (하이라이트 배경)
  100: '#d9c6fb',  // 우윳빛 라벤더
  200: '#b99bee',  // 소프트 라일락톤
  300: '#9a70da',  // 상큼한 퍼플 포인트
  400: '#7f4fc4',  // 진한 보라 (컬러 포인트, 아이콘용)
  500: '#6937a6',  // 고급 퍼플 (기본 포인트 컬러)
  600: '#522a89',  // 어두운 퍼플 강조
  700: '#3c1f6b',  // 텍스트, 딥 배경 포인트
  800: '#29134b',  // 무게감 있는 딥 퍼플 (다크배경)
  900: '#1a0a31',  // 거의 블랙 퍼플, 다크모드 백그라운드
};

export const indigo = {
  50:  '#0a102a',  // 거의 블랙에 가까운 딥 블루 (최딥)
  100: '#121b3a',  // 깊고 진한 남색 (메인 다크 배경)
  200: '#1c2854',  // 밤하늘 블루 느낌 (콘텐츠 배경용)
  300: '#273b76',  // 어두운 블루 퍼플톤 (텍스트 대비 강조)
  400: '#4c6adb',  // 명확하고 선명한 블루
  500: '#5f7eff',  // 활기찬 블루 포인트
    600: '#829cff',  // 보라기 섞인 부드러운 블루
  700: '#a5baff',  // 블루베리 우윳빛
  800: '#e3e8ff',  // 밝은 라벤더 배경
  900: '#f3f4ff',  // 거의 흰색, 라이트모드 배경용
};

export const yellow = {
  50:  '#FFFDF3',
  100: '#FFF9DB',
  200: '#FFF4B8',
  300: '#FFED8F',
  400: '#FFE566',
  500: '#FFDD3F',
  600: '#FFD726',
  700: '#F2C400',
  800: '#D6AD00',
  900: '#B59300',
};

export const white = {
  500: '#FFFFFF',
};

export const transparentRed = {
  500: '#FF5A6533',
};

export const transparentGreen = {
  500: '#05C16833',
};

export const transparentYellow = {
  500: '#FFB01633',
};
